[
  {
    "profile_url": "https://wiganwarriors.com/player/jai-field/",
    "name": "Jai Field",
    "position": "Full Back",
    "nationality": "Australian",
    "date_of_birth": "06.09.1997",
    "heritage_number": "1111",
    "debut": "28.03.2021",
    "career_stats": {
      "appearances": "30",
      "tries": "24",
      "goals": "4",
      "games": "11"
    },
    "honours": {
      "Challenge Cup": "Final at the Tottenham Hotspur Stadium, contributing to the win against the Huddersfield Giants.",
      "Super League": "Grand Final to his tally, starting at full back in Wigan’s win over Catalans Dragons at Old Trafford in 2023.",
      "League Leaders Shield": "2",
      "World Club Challenge": ", Challenge Cup, League Leaders’ Shield and Super League all in the same season."
    },
    "sponsors": [
      "LDL Lighting"
    ],
    "bio": "In an outstanding year for Field, he was awarded Player of the Year and Players’ Player of the Year at the annual Club awards, he won Broadcast & Writers association Player of the Year and was also shortlisted for the 2022 Man of Steel award, picking up numerous Player and Try of the month awards throughout the season.",
    "career_highlights": [
      "2021 Player Bio Known for his lightning quick feet and tricky ball skills, Field began his career at St George Illawarra before moving to Parramatta Eels.",
      "2017 and 2019, he joined Parramatta Eels in 2020 where he made six appearances.",
      "2020 on a two-year deal starting from 2021.",
      "2021 season, the 23-year-old was assigned the No.",
      "2021 Round 1 win over Leigh Centurions, but it was cut short after he suffered a hamstring injury in the first half.",
      "2021 but suffered a further injury a few games later, this time on his groin and did not feature again in 2021.",
      "2022, Field announced that he had signed a two-year deal with the Club with an option of a third year meaning the Aussie will remain in cherry & white until at least the end of 2024.",
      "2022, Field scored a try in the second half of the Challenge Cup Final at the Tottenham Hotspur Stadium, contributing to the win against the Huddersfield Giants.",
      "2022, the second most by any player that season.",
      "2022 Man of Steel award, picking up numerous Player and Try of the month awards throughout the season.",
      "2024, winning the World Club Challenge, Challenge Cup, League Leaders’ Shield and Super League all in the same season."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/abbas-miski/",
    "name": "Abbas Miski",
    "position": "Outside Backs",
    "nationality": "Lebanese",
    "date_of_birth": "25.07.1995",
    "heritage_number": "1116",
    "debut": "05.03.2022",
    "career_stats": {
      "appearances": "13",
      "tries": "29",
      "games": "26"
    },
    "honours": {
      "Challenge Cup": ", League Leaders’ Shield and Super League all in the same season.",
      "Super League": ".",
      "League Leaders Shield": "2",
      "World Club Challenge": ", Challenge Cup, League Leaders’ Shield and Super League all in the same season."
    },
    "sponsors": [
      "The Hey Group"
    ],
    "bio": "In 2019, Miski signed for Black Workers Sea Eagles, a feeder team for Manly before being called into Manly Warringah Sea Eagles first team to make his debut in 2019, in the same year he was top try scorer for Black Workers with 12 tries. Miski was called in to first team squad for Manly’s final game of the season in 2020, scoring two tries in a loss.",
    "career_highlights": [
      "2022 Player Bio A prolific finisher on the wing, Miski shot up in the ranks in a Top Try Scoring season in 2023.",
      "2017 World Cup and most recently the rescheduled RLWC2021 held in England.",
      "2020, scoring two tries in a loss.",
      "2021 season, where in 13 appearances for Broncos, he scored 12 tries before he joined Wigan for the 2022 season on a three-year deal.",
      "2022 and scored his first try for the Club against Wakefield Trinity at the DW Stadium on Easter Monday 2022.",
      "2023, Miski spend some time on loan before being called into the first team following some injuries.",
      "2023, lifting both the League Leaders’ Shield and the Super League trophy.",
      "2024, winning the World Club Challenge, Challenge Cup, League Leaders’ Shield and Super League all in the same season."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/adam-kieghran/",
    "name": "Adam Keighran",
    "position": "Outside Backs",
    "nationality": "Australian",
    "date_of_birth": "24.04.1997",
    "heritage_number": "1130",
    "debut": "17.02.2024",
    "career_stats": {
      "goals": "35",
      "games": "17"
    },
    "honours": {
      "Super League": "move came in 2023, as he joined Super League side Catalans Dragons on a one-year deal. He caught the eye of many as the Dragons launched an impressive season, going on to reach the Super League Grand Final.",
      "League Leaders Shield": "1",
      "World Club Challenge": ", League Leaders’ Shield and Super League."
    },
    "sponsors": [
      "ASAP Scaffolding"
    ],
    "bio": "Playing his trade as a Centre in 2023, Keighran joined Wigan Warriors on a two-year deal where he lifted a treble of trophies in his first season with the Club – winning the World Club Challenge, League Leaders’ Shield and Super League.",
    "career_highlights": [
      "2024 Player Bio Adam Keighran joins the Warriors ahead of the 2024 season, after a successful season with Catalans Dragons in 2023.",
      "2019, going on to make nine appearances over two seasons.",
      "2021 after signing for the Roosters, where he scored four tries and kicked 35 goals in 17 games for Trent Robinson’s side.",
      "2023, as he joined Super League side Catalans Dragons on a one-year deal."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/jake-wardle/",
    "name": "Jake Wardle",
    "position": "Centre",
    "nationality": "British",
    "date_of_birth": "18.11.1998",
    "heritage_number": "1128",
    "debut": "18.02.2023",
    "career_stats": {
      "appearances": "31",
      "tries": "16"
    },
    "honours": {
      "Challenge Cup": ", League Leaders’ Shield and Super League all in the same season.",
      "Super League": ".",
      "League Leaders Shield": "2",
      "World Club Challenge": ", Challenge Cup, League Leaders’ Shield and Super League all in the same season."
    },
    "sponsors": [
      "Sunbelt Rentals"
    ],
    "bio": "Halifax-born Wardle is an England international having made his try-scoring debut in a win over the Combined Nations All Stars in 2022. He has also represented England Knights’ on one occasion in a win over France in 2022.",
    "career_highlights": [
      "2023 Player Bio A proven try scorer and versatile outside back, Wardle joined the Warriors in 2023 on a three-year deal.",
      "2023, as well as winning the Harry Sunderland trophy for Man of the Match in the 2023 Super League Grand Final.",
      "2024, winning the World Club Challenge, Challenge Cup, League Leaders’ Shield and Super League all in the same season."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/liam-marshall/",
    "name": "Liam Marshall",
    "position": "Wing",
    "nationality": "British",
    "date_of_birth": "09.05.1996",
    "heritage_number": "1075",
    "debut": "03.03.2017",
    "career_stats": {
      "appearances": "22",
      "tries": "26",
      "games": "24"
    },
    "honours": {
      "Challenge Cup": "Final against Hull FC at Wembley Stadium.",
      "Super League": "Grand Final that saw Wigan crowned Champions.",
      "League Leaders Shield": "3",
      "World Club Challenge": ", Challenge Cup, League Leaders’ Shield and Super League all in the same season."
    },
    "sponsors": [
      "Metro Rod"
    ],
    "bio": "He returned to the side in 2019, becoming Wigan’s top try scorer for the season with 17 in 24 games and Marshall had a bright start to 2020, but his season was cut short once again, this time with a knee ligament injury sustained against Castleford in late August. He appeared ten times, scoring six tries.",
    "career_highlights": [
      "2017 Player Bio Renowned for his acrobatic diving style when scoring tries, Liam Marshall is an entertainer on the pitch and a recognised try scorer in the first team.",
      "2016, scoring 20 tries in 22 appearances.",
      "2017 season and he had a dream debut campaign, playing 24 times, scoring 23 tries and being named joint Wigan Warriors Young Player of the Year.",
      "2017 Challenge Cup Final against Hull FC at Wembley Stadium.",
      "2018 after a string of stand-out performances.",
      "2021 after a 10-month spell on the sidelines recovering from the ACL injury and went on to make 16 appearances, scoring 7 tries.",
      "2022 and in October 2022, Marshall also announced that he had signed a new 3-year deal that would see the winger remain at his hometown Club until 2025.",
      "2023 continued to be a strong year for the winger, who appeared 29 times across the year – scoring 24 tries.",
      "2023 Super League Grand Final that saw Wigan crowned Champions.",
      "2024, winning the World Club Challenge, Challenge Cup, League Leaders’ Shield and Super League all in the same season."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/bevan-french/",
    "name": "Bevan French",
    "position": "Halves",
    "nationality": "Australian",
    "date_of_birth": "04.01.1996",
    "heritage_number": "1098",
    "debut": "09.08.2019",
    "career_stats": {
      "appearances": "47",
      "tries": "35",
      "games": "21"
    },
    "honours": {
      "League Leaders Shield": "3"
    },
    "sponsors": [
      "Di Taylor & Alex Crompton"
    ],
    "bio": "French was part of the Warriors team who completed the Grand Slam in 2024, winning the World Club Challenge, Challenge Cup, League Leaders’ Shield and Super League all in the same season. He also made history as the first player to win the Player of the Match awards in the same season (Bill Ashurst Medal in the World Club Challenge, Lance Todd Trophy in the Challenge Cup and the inaugural Rob Burrow Award in the Super League Grand Final.)",
    "career_highlights": [
      "2019 Player Bio Renowned for his electric pace and dancing feet, Bevan French can play a variety of positions in the backline and in the halves.",
      "2016 and scored 35 tries overall.",
      "2019 season after being granted a release from Parramatta.",
      "2019 and scored six tries.",
      "2020 season, touching down 17 tries in 21 games in all competitions and alongside fellow Warrior Liam Farrell, he was named in the 2020 Betfred Super League Dream Team at full back.",
      "2020 and shortlisted for the 2020 Steve Prescott Man of Steel.",
      "2021 and returned home to Australia to complete rehabilitation before exercising his additional year option, returning to the Warriors for pre-season ahead of the 2022 season.",
      "2022 and his fantastic work in the 2022 season saw him selected in the Super League Dream Team for a second time in his career.",
      "2022 Super League awards as he finished the year with 31 tries.",
      "2023, French was an ever-present, playing in all 32 available matches across the year.",
      "2023, and was named in the Super League Dream Team for a third time, in a third different position – this time at Stand Off.",
      "2023, after an exceptional year for the Warriors.",
      "2024, winning the World Club Challenge, Challenge Cup, League Leaders’ Shield and Super League all in the same season."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/harry-smith/",
    "name": "Harry Smith",
    "position": "Half Back",
    "nationality": "British",
    "date_of_birth": "25.01.2000",
    "heritage_number": "1099",
    "debut": "06.09.2019",
    "career_stats": {
      "appearances": "24",
      "tries": "7",
      "goals": "100",
      "games": "32"
    },
    "honours": {
      "Challenge Cup": "Final, scoring a try in the first half, kicking 2/3 conversions and a putting through a grubber kick to set-up Liam Marshall’s winning try.",
      "Super League": "Grand Final.",
      "League Leaders Shield": "3",
      "World Club Challenge": ", Challenge Cup, League Leaders’ Shield and Super League all in the same season."
    },
    "sponsors": [
      "Bluesky Plumbing"
    ],
    "bio": "The half back’s rise through the Academy saw him become captain of the Under-19s, as well as a three-time Grand Final winner (2017, 2018 and 2019) and the 2018 Under-19s Player of the Year. Smith was influential as he captained England’s Academy side to a 2-0 series win against Australia in December 2018.",
    "career_highlights": [
      "2000 Heritage Number 1099 Debut 06.",
      "2019 Player Bio Better known for his on-pitch organisation, Harry Smith is an ever-present for the Warriors in the halves.",
      "2017, 2018 and 2019) and the 2018 Under-19s Player of the Year.",
      "2019, the scrum half joined Swinton Lions on loan in the Championship, as well as playing for Wigan’s Under-19s.",
      "2019, coming off the bench and scoring a try in a 46-12 win over Catalans Dragons at the DW Stadium.",
      "2020, making 17 appearances, scoring four tries and converting two drop goals.",
      "2021 saw Smith’s career go one step further, the Half back played in every game for Wigan, a total of 28.",
      "2022 Challenge Cup Final, scoring a try in the first half, kicking 2/3 conversions and a putting through a grubber kick to set-up Liam Marshall’s winning try.",
      "2022, making 24 appearances in 2022, scoring 7 tries, 94 goals and 2 match-winning drop goals.",
      "2022 as he came off the bench as England beat Fiji 50-0.",
      "2023, Smith made the number 7 shirt his own.",
      "2024, winning the World Club Challenge, Challenge Cup, League Leaders’ Shield and Super League all in the same season."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/ethan-havard/",
    "name": "Ethan Havard",
    "position": "Prop Forward",
    "nationality": "British",
    "date_of_birth": "26.10.2000",
    "heritage_number": "1097",
    "debut": "18.07.2019",
    "career_stats": {
      "appearances": "42",
      "tries": "16",
      "games": "18"
    },
    "honours": {
      "Challenge Cup": "Final, Havard came off the bench to join the winning side against the Huddersfield Giants at the Tottenham Hotspur Stadium. The prop-forward made 22 appearances in 2022, scoring 5 tries in his best scoring return for the Club to date.",
      "Super League": "Grand Final win over Catalans Dragons.",
      "League Leaders Shield": "3"
    },
    "sponsors": [
      "Fisher German Priestner"
    ],
    "bio": "Havard impressed in his debut season as a full professional, making 11 appearances before having his season cut short with an ankle injury. He picked up the first silverware of his career with Wigan’s League Leaders’ Shield success in November. The 2020 season ended with personal success too, with the young forward being named Wigan’s Young Player of the Year at the Club’s End of Season Awards Night.",
    "career_highlights": [
      "2000 Heritage Number 1097 Debut 18.",
      "2019 Player Bio A 23-year-old prop forward who was born in Sofia, Bulgaria before growing up in Wigan to later join the Club’s Academy where he would progress to the first team.",
      "2017 and was awarded The Riversiders (Wigan Warriors Supporters Club) Under-16s Player of the Year.",
      "2018, he moved up to the Under-19s level in Wigan’s Academy and played a part in the Grand Final winning squad that beat Leeds Rhinos 14-6 at the DW Stadium in September.",
      "2019, the 6ft 3 forward made his professional debut for the Club in the 46-16 win over Wakefield Trinity in July.",
      "2020 season ended with personal success too, with the young forward being named Wigan’s Young Player of the Year at the Club’s End of Season Awards Night.",
      "2021, making 25 appearances and also scoring first try in Cherry & White against Warrington Wolves at the Dacia Magic Weekend in Newcastle.",
      "2022 Challenge Cup Final, Havard came off the bench to join the winning side against the Huddersfield Giants at the Tottenham Hotspur Stadium.",
      "2022, scoring 5 tries in his best scoring return for the Club to date.",
      "2023 saw Havard troubled with injuries, as such he only played 18 games, scoring two tries.",
      "2023, that will see him stay with the Club until at least the end of 2027.",
      "2023 Super League Grand Final win over Catalans Dragons.",
      "2024 Super League Grand Final."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/brad-oneil/",
    "name": "Brad O'Neill",
    "position": "Hooker",
    "nationality": "British",
    "date_of_birth": "22.07.2002",
    "heritage_number": "1112",
    "debut": "24.06.2021",
    "career_stats": {
      "appearances": "13",
      "games": "8"
    },
    "honours": {
      "Challenge Cup": "victory at Hooker in 2022.",
      "Super League": "Champions.",
      "League Leaders Shield": "2",
      "World Club Challenge": "and Challenge Cup to his honours in 2024."
    },
    "sponsors": [
      "MA Brickworks"
    ],
    "bio": "In March 2021, he played for the first time in over 20 months – gaining first team experience for the Warriors, as he featured in the pre-season friendly against Salford Red Devils before signing for Widnes Vikings on a four-week loan deal in April 2021. His spell with the Betfred Championship club was extended and he played nine games and scored two tries in his time there. He also made an average of 42 tackles per game.",
    "career_highlights": [
      "2002 Heritage Number 1112 Debut 24.",
      "2021 Player Bio A product of Wigan’s Academy system, Brad O’Neill has become a regular name on the Warriors teamsheet, inspiring Wigan to Challenge Cup victory at Hooker in 2022.",
      "2017, O’Neill signed for Wigan’s Scholarship system and played two seasons for the Under-16s team.",
      "2019 and also represented Lancashire Academy twice.",
      "2020 – a year which saw all Academy games suspended due to the Covid-19 pandemic.",
      "2022, O’Neill secured his first Challenge Cup win against the Huddersfield Giants at the Tottenham Hotspur Stadium, coming into the squad a few weeks prior in place of Sam Powell.",
      "2022, and was influential in Wigan’s Challenge Cup run as starting hooker in both the Semi Final and Final.",
      "2023 was a key season for the young hooker, who found a more consistent run of games for the Warriors."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/luke-thompson/",
    "name": "Luke Thompson",
    "position": "Prop Forward",
    "nationality": "British",
    "date_of_birth": "27.04.1995",
    "heritage_number": "1131",
    "debut": "17.02.2024",
    "career_stats": {
      "appearances": "15",
      "tries": "2013",
      "games": "163"
    },
    "honours": {
      "Challenge Cup": "in a starting appearance at Wembley Stadium, as well as adding a League Leaders’ Shield and Super League Trophy to his tally with the Warriors in his first season with the Club.",
      "Super League": "Grand Final victory over Wigan off the interchange bench.",
      "League Leaders Shield": "1",
      "World Club Challenge": "game through a failed HIA but lifted the Betfred Challenge Cup in a starting appearance at Wembley Stadium, as well as adding a League Leaders’ Shield and Super League Trophy to his tally with the Warriors in his first season with the Club."
    },
    "sponsors": [
      "Cadena Global"
    ],
    "bio": "He signed for Wigan in October 2023 on a four-year deal and boulstered the Warriors forward pack in the 2024 season. The forward missed Wigan’s Betfred World Club Challenge game through a failed HIA but lifted the Betfred Challenge Cup in a starting appearance at Wembley Stadium, as well as adding a League Leaders’ Shield and Super League Trophy to his tally with the Warriors in his first season with the Club.",
    "career_highlights": [
      "2024 Player Bio A new member of the forward pack, Luke Thompson joins the Warriors for the 2024 season from Canterbury Bulldogs.",
      "2018 and 2019 following two uncompromising seasons.",
      "2020, he made the switch to the NRL with Canterbury-Bankstown Bulldogs, going on to score his first try for the Club in Round 5 of the 2021 season.",
      "2021, with a further 13 in 2022.",
      "2023 on a four-year deal and boulstered the Warriors forward pack in the 2024 season."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/junior-nsemba/",
    "name": "Junior Nsemba",
    "position": "Second Row",
    "date_of_birth": "27.06.2004",
    "heritage_number": "1120",
    "debut": "29.08.2022",
    "career_stats": {
      "appearances": "6",
      "tries": "5"
    },
    "honours": {
      "Challenge Cup": ".",
      "League Leaders Shield": "2"
    },
    "sponsors": [
      "Smith Metal Centres"
    ],
    "bio": "Nsemba was a treble winner with the Warriors in 2024 lifting the Challenge Cup, League Leaders’ Shield and Super League trophy. He was also named Young Player of the Year at the annual Super League Awards, whilst also claiming the same award at the Clubs’ 2024 awards.",
    "career_highlights": [
      "2004 Heritage Number 1120 Debut 29.",
      "2022 Player Bio Nsemba played at Academy/Reserve and First Grade Levels in 2022 and continues his development in the First Team in 2024.",
      "2022 including a hat-trick of tries against London Broncos in an Academy game in 2022.",
      "2022 and was named The Riversiders Academy Player of the Season for 2022.",
      "2023, whilst still featuring in the Reserves grade.",
      "2024 lifting the Challenge Cup, League Leaders’ Shield and Super League trophy.",
      "2024, Nsemba announced he had signed a new six-year deal to remain with the Warriors until 2030."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/liam-farrell/",
    "name": "Liam Farrell",
    "position": "Second Row",
    "nationality": "British",
    "date_of_birth": "02.07.1990",
    "heritage_number": "1017",
    "debut": "05.04.2010",
    "career_stats": {
      "appearances": "24",
      "tries": "15",
      "games": "300"
    },
    "honours": {
      "Challenge Cup": "winner with Wigan – with successes in 2011 (vs Leeds Rhinos), 2013 (vs Hull FC) and 2022 (vs Huddersfield Giants).",
      "League Leaders Shield": "5",
      "World Club Challenge": "squad that beat Cronulla Sharks at the DW Stadium, completing his trophy set."
    },
    "sponsors": [
      "PDQ Communications"
    ],
    "bio": "The 2020 season marked Farrell’s testimonial year for Wigan. The Warriors took on Leeds Rhinos in his testimonial friendly fixture, taking place at the DW Stadium ahead of the Betfred Super League season at the end of January. A fantastic 2020 campaign then lay ahead for the second row, who appeared 21 times for Wigan, scoring ten tries – helping the Warriors clinch their first silverware since 2018, lifting the League Leaders’ Shield.",
    "career_highlights": [
      "2010 Player Bio A one-Club man who is one of the most decorated players in the Wigan team – winning all there is to claim in the game – he is now Captain of the Club.",
      "2010 and went on to complete a dream first season playing 23 games, including the Grand Final win over St Helens.",
      "2011 will be part of club folklore.",
      "2011 (vs Leeds Rhinos), 2013 (vs Hull FC) and 2022 (vs Huddersfield Giants).",
      "2010, 2012, 2020 and 2023.",
      "2010 vs St Helens and 2013, 2016, 2018 vs Warrington Wolves and 2023 vs Catalans Dragons).",
      "2013 World Cup and was an ever-present in the 2014 Four Nations Series.",
      "2016 Grand Final and was also part of the 2017 World Club Challenge squad that beat Cronulla Sharks at the DW Stadium, completing his trophy set.",
      "2019 under Adrian Lam – a season which saw him being named in the Super League Dream Team for the second time in his career (2015 was his first time).",
      "2020 season marked Farrell’s testimonial year for Wigan.",
      "2020 Betfred Super League Dream Team alongside teammate Bevan French.",
      "2020 Steve Prescott Man of Steel.",
      "2020 End of Season Awards evening, as Lam highlighted the Englishman’s professionalism on and off the field in a challenging season for all.",
      "2021, including a stint at Centre, grabbing 9 tries along the way.",
      "2021 also saw Farrell named in the Super League Dream Team for a fourth time (2015, 2019, 2020) as well as picking up Player’s Player of the Year at the Warriors End of Season Awards evening.",
      "2022, Liam Farrell was announced as the new Club Captain and went on to Captain his side to more silverware in 2023.",
      "2023, having featured 30 times and scoring 9 tries in the campaign which saw Wigan lift the League Leaders’ Shield and beat Catalans Dragons 10-2 in the Betfred Super League Grand Final.",
      "2024, Farrell captained Wigan to an historic Grand Slam, winning the World Club Challenge, Challenge Cup, League Leaders’ Shield and Super League all in the same season."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/kaide-ellis/",
    "name": "Kaide Ellis",
    "position": "Prop Forward",
    "nationality": "Australian",
    "date_of_birth": "04.08.1996",
    "heritage_number": "1114",
    "debut": "11.02.2022",
    "career_stats": {
      "appearances": "23",
      "games": "8"
    },
    "honours": {
      "Challenge Cup": "Final at the Tottenham Hotspur Stadium.",
      "Super League": "Grand Final to his honours with the Club.",
      "League Leaders Shield": "2",
      "World Club Challenge": ", Challenge Cup, League Leaders’ Shield and Super League all in the same season."
    },
    "sponsors": [
      "Smalley Painters and Decorators"
    ],
    "bio": "The Prop forward joined Wigan for the 2022 season on a three-year deal and in May 2022, during his first season at the club, Ellis came off the bench to help secure a win against the Huddersfield Giants in the Challenge Cup Final at the Tottenham Hotspur Stadium.",
    "career_highlights": [
      "2022 Player Bio A solid workhouse in the forward pack, Ellis is an ever-present in the Wigan side.",
      "2015 National Youth Competition Grand Final.",
      "2018 against Gold Coast Titans, which ended in a 35-12 victory for Penrith Panthers.",
      "2018/19 before he was released and signed for St George for the 2020 and 2021 seasons, making 18 appearances.",
      "2023, Ellis continued his good form and went on to make another 21 appearances.",
      "2023 to keep him at the Club until the end of the 2026 season.",
      "2023, he also added a League Leaders’ Shield and a Super League Grand Final to his honours with the Club.",
      "2024, winning the World Club Challenge, Challenge Cup, League Leaders’ Shield and Super League all in the same season."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/patrick-mago/",
    "name": "Patrick Mago",
    "position": "Prop Forward",
    "nationality": "Samoan",
    "date_of_birth": "04.12.1994",
    "heritage_number": "1115",
    "debut": "11.02.2022",
    "career_stats": {
      "appearances": "31",
      "tries": "2",
      "games": "23"
    },
    "honours": {
      "Challenge Cup": "Final at the Tottenham Hotspur Stadium.",
      "Super League": "Grand Final.",
      "League Leaders Shield": "2",
      "World Club Challenge": ", Challenge Cup, League Leaders’ Shield and Super League all in the same season."
    },
    "sponsors": [
      "Brockwells Forestry"
    ],
    "bio": "He previously played for North Queensland Cowboys, Brisbane Broncos and South Sydney Rabbitohs. Mago made his debut for Cowboys in Round 23 game against Penrith Panthers in 2017 and with just 2 appearances for the Panthers he then signed for Brisbane Broncos for 2018 season.",
    "career_highlights": [
      "2022 Player Bio A reliable forward pack member, Mago takes the number 15 shirt for Wigan in 2024.",
      "2017 and with just 2 appearances for the Panthers he then signed for Brisbane Broncos for 2018 season.",
      "2020, making a further 11 appearances in 2021.",
      "2022 on a three-year deal and in May 2022, Mago came off the bench to help secure a win against the Huddersfield Giants in the Challenge Cup Final at the Tottenham Hotspur Stadium.",
      "2023, Mago signed a one-year contract extension which sees him remain at the Club for the 2024 season, with the option in Wigan’s favour for a further year in 2025.",
      "2024, winning the World Club Challenge, Challenge Cup, League Leaders’ Shield and Super League all in the same season."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/liam-byrne/",
    "name": "Liam Byrne",
    "position": "Prop Forward",
    "nationality": "Irish",
    "date_of_birth": "18.08.1999",
    "heritage_number": "1092",
    "debut": "25.02.2019",
    "career_stats": {
      "appearances": "29"
    },
    "honours": {
      "Super League": "all in the same season.",
      "League Leaders Shield": "2",
      "World Club Challenge": ", Challenge Cup, League Leaders’ Shield and Super League all in the same season."
    },
    "sponsors": [
      "Official Car Mats"
    ],
    "bio": "Internationally, Byrne has Irish heritage and has previously played in the 2018 European Championships and 2022 World Cup. He featured in World Cup qualifier matches for the Irish at the end of 2019 – helping his side to reach the 2021 tournament with a victory over Italy and featured in the first two of Ireland’s group stage matches at RLW21.",
    "career_highlights": [
      "2019 Player Bio Liam Byrne has excelled in the last few years and has quickly become a consistent starter in Matt Peet’s first team.",
      "2017 before he spent two years in the Academy and became a double Under-19s Grand Final winner.",
      "2018 Wigan Warriors Official Supporters Club ‘Riversiders’ Player of the Year.",
      "2019 and scored his first try for the Club against Hull FC at the DW Stadium.",
      "2019, he made 14 appearances under Adrian Lam and became a real force in Wigan’s forward pack.",
      "2018 European Championships and 2022 World Cup.",
      "2019 – helping his side to reach the 2021 tournament with a victory over Italy and featured in the first two of Ireland’s group stage matches at RLW21.",
      "2020 proved to be a solid season for the young prop forward, making 11 appearances and scoring one try.",
      "2021 as the prop forward made 25 appearances for the Warriors.",
      "2022, Byrne was selected for Ireland for the RLWC2021 and went on to make two appearances in the tournament group stages.",
      "2023, Byrne added a second League Leaders’ Shield to his honours tally but missed out on a Grand Final appearance for the Club after picking up an injury late in the season.",
      "2024, winning the World Club Challenge, Challenge Cup, League Leaders’ Shield and Super League all in the same season."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/kruise-leeming/",
    "name": "Kruise Leeming",
    "position": "Hooker",
    "date_of_birth": "07.09.1995",
    "heritage_number": "1132",
    "debut": "17.02.2024",
    "career_stats": {
      "appearances": "10",
      "games": "100"
    },
    "honours": {
      "Challenge Cup": "at Wembley Stadium with the Rhinos in the same year.",
      "Super League": "Grand Final in 2022, and scored a first half try at Old Trafford though the Rhinos were defeated by St Helens on the big stage.",
      "League Leaders Shield": "1"
    },
    "sponsors": [
      "CSC2 Cyber Consulting"
    ],
    "bio": "He joined Wigan for the 2024 season on a three-year deal where he went on to make a try-scoring appearance in Wigan’s Betfred World Club Challenge win over Penrith Panthers. Leeming was part of the Warriors team who completed the Grand Slam in 2024, winning the World Club Challenge, Challenge Cup, League Leaders’ Shield and Super League all in the same season.",
    "career_highlights": [
      "2024 Player Bio A new addition for 2024, Kruise Leeming is a well-seasoned option at Hooker for the Warriors.",
      "2013 and went on to play over 100 games over a seven year stint.",
      "2018 and went on to feature in the Knights’ tour of Papua New Guinea in the same year.",
      "2019 to take on Jamaica.",
      "2020, Leeming joined Leeds Rhinos and went on to win the Challenge Cup at Wembley Stadium with the Rhinos in the same year.",
      "2021, as they claimed one win and took one defeat against England.",
      "2022, and scored a first half try at Old Trafford though the Rhinos were defeated by St Helens on the big stage.",
      "2023, the hooker was released by Leeds and went over to join NRL side Gold Coast Titans on a one-year deal, where he made 10 appearances and scored two tries.",
      "2024 season on a three-year deal where he went on to make a try-scoring appearance in Wigan’s Betfred World Club Challenge win over Penrith Panthers.",
      "2024, winning the World Club Challenge, Challenge Cup, League Leaders’ Shield and Super League all in the same season."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/tyler-dupree/",
    "name": "Tyler Dupree",
    "position": "Prop Forward",
    "date_of_birth": "08.02.2000",
    "heritage_number": "1129",
    "debut": "28.07.2023",
    "career_stats": {
      "appearances": "35"
    },
    "honours": {
      "Super League": "Grand Final win in the process.",
      "League Leaders Shield": "2",
      "World Club Challenge": ", League Leaders’ Shield and Super League all in the same season."
    },
    "sponsors": [
      "Steve Woods Ltd"
    ],
    "bio": "The prop forward enjoyed a dream debut off the bench, scoring against Leigh Leopards at the DW Stadium. He went on to make 9 appearances in 2023 earning a League Leaders’ Shield and a Super League Grand Final win in the process.",
    "career_highlights": [
      "2000 Heritage Number 1129 Debut 28.",
      "2023 Player Bio A Grand Final winner with Wigan in 2023, Dupree is ready for his first full season with the Club in 2024.",
      "2023, starting the game on the bench.",
      "2023, having made 35 appearances for the Red Devils.",
      "2023 earning a League Leaders’ Shield and a Super League Grand Final win in the process.",
      "2024, Dupree was a treble winner with the Warriors winning the World Club Challenge, League Leaders’ Shield and Super League all in the same season."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/harvie-hill/",
    "name": "Harvie Hill",
    "position": "Prop Forward",
    "nationality": "British",
    "date_of_birth": "03.09.2003",
    "heritage_number": "1124",
    "debut": "29.08.2022",
    "career_stats": {
      "appearances": "14"
    },
    "honours": {
      "League Leaders Shield": "2",
      "World Club Challenge": "1"
    },
    "sponsors": [
      "Unique Wellbeing Solutions"
    ],
    "bio": "He was spotted by Wigan scouts whilst playing for Hensingham against Wigan St Patricks in the U14’s National Cup and subsequently come through the Warriors Academy system.",
    "career_highlights": [
      "2003 Heritage Number 1124 Debut 29.",
      "2022 Player Bio Harvie was one of seven debutants in the Betfred Super League game at Hull KR in August 2022 and went on to feature in the first team in 2023.",
      "2021 and went on to make his debut, alongside six other players in 2022.",
      "2023, Hill received a first team squad number and made 14 appearances off the interchange bench, winning a League Leaders’ Shield at 20-years-old.",
      "2023 on the international stage."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/sam-walters/",
    "name": "Sam Walters",
    "position": "Second Row",
    "nationality": "British",
    "date_of_birth": "25.12.2000",
    "debut": "year which saw him named as Academy Player of the Year after scoring nine tries in 15 starts.",
    "honours": {
      "Super League": "champions.",
      "League Leaders Shield": "1"
    },
    "sponsors": [
      "Pall Mall Carpets & Beds"
    ],
    "bio": "After signing for Leeds Rhinos at the start of the 2019 Academy season, Walters, who stands at 6’7″, hit the ground running as he scored two tries in his first Under 19’s game. He went on to have a stand-out debut year which saw him named as Academy Player of the Year after scoring nine tries in 15 starts.",
    "career_highlights": [
      "2000 Player Bio After an impressive 2023 campaign, Sam Walters is ready to make an impact for the reigning Super League champions.",
      "2019 Academy season, Walters, who stands at 6’7″, hit the ground running as he scored two tries in his first Under 19’s game.",
      "2019 Academy Origin Series.",
      "2019, before he made his Super League debut for Leeds Rhinos in September 2020 against Catalans Dragons.",
      "2022, before he finished the year off with an interchange appearance in the Super League Grand Final at Old Trafford.",
      "2023 scoring six tries in 17 matches before it was announced in June 2023 that he would join the Warriors from the start of the 2024 season."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/zach-eckersley/",
    "name": "Zach Eckersley",
    "position": "Centre",
    "nationality": "British",
    "date_of_birth": "10.11.2003",
    "heritage_number": "1125",
    "debut": "29.08.2022",
    "honours": {
      "Challenge Cup": "Final where he scored the opening try of the game before lifting the silverware in the 18-8 win over Warrington.",
      "League Leaders Shield": "1"
    },
    "sponsors": [
      "John Pye Auctions"
    ],
    "bio": "Eckersley started at Centre for the Warriors in the 2024 Betfred Challenge Cup Final where he scored the opening try of the game before lifting the silverware in the 18-8 win over Warrington.",
    "career_highlights": [
      "2003 Heritage Number 1125 Debut 29.",
      "2022 Player Bio Eckersley made his debut off the bench in the game at Hull KR in August 2022 as one of seven debutants.",
      "2022, along with six other debutants and featured in Wigan’s pre-season campaign ahead of the 2023 season.",
      "2024 Betfred Challenge Cup Final where he scored the opening try of the game before lifting the silverware in the 18-8 win over Warrington."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/tom-forber/",
    "name": "Tom Forber",
    "position": "Hooker",
    "nationality": "British",
    "date_of_birth": "22.05.2003",
    "heritage_number": "1123",
    "debut": "29.08.2022",
    "career_stats": {
      "appearances": "10"
    },
    "honours": {
      "Super League": "Trophy.",
      "League Leaders Shield": "1"
    },
    "sponsors": [
      "Care Love Learn Childcare"
    ],
    "bio": "In 2024, Forber was called into first team action, making 10 appearances off the interchange bench and becoming a double-winner with the Warriors after lifting the League Leaders’ Shield and Super League Trophy.",
    "career_highlights": [
      "2003 Heritage Number 1123 Debut 29.",
      "2022 Player Bio Forber made his debut off the bench in the game at Hull KR in August 2022 as one of seven debutants.",
      "2022, including scoring a try in Newcastle’s 53-10 home win over Bradford Bulls.",
      "2022, along with six other debutants and featured in Wigan’s pre-season campaign ahead of the 2023 season.",
      "2023, he spent time on loan at Whitehaven, Wakefield and Widnes to build-up some experience and game time."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/jack-farrimond/",
    "name": "Jack Farrimond",
    "position": "Half Back",
    "heritage_number": "1134",
    "debut": "09.03.2024",
    "career_stats": {
      "tries": "11",
      "goals": "71"
    },
    "honours": {
      "Super League": "title defence campaign.",
      "League Leaders Shield": "1"
    },
    "sponsors": [
      "The Carroll Family"
    ],
    "bio": "In 2024, Farrimond made his Betfred Super League debut in a Round 4 victory at London Broncos before scoring twice in the reverse fixture on his home debut. The youngster made six additional appearances in the competition which included a memorable Magic Weekend try against St Helens at Elland Road.",
    "career_highlights": [
      "2023, the goal-kicking half was also called up to England’s Academy squad under Head Coach Paul Anderson ahead of their fixture against France in July – although missed out on the match day team.",
      "2023 Reserves Grand Final.",
      "2024, Farrimond made his Betfred Super League debut in a Round 4 victory at London Broncos before scoring twice in the reverse fixture on his home debut."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/sam-eseh-jr/",
    "name": "Sam Eseh Jr",
    "position": "Prop Forward",
    "date_of_birth": "30.06.2003",
    "debut": "in Wakefield’s defeat to Huddersfield Giants in Round 8 of the 2023 season, went on to make 15 appearances for Trinity in the competition. The 20-year-old was crowned Wakefield’s Young Player of the Season at the Club’s end of year awards.",
    "career_stats": {
      "appearances": "15"
    },
    "sponsors": [
      "Elite Performance Sports Massage"
    ],
    "bio": "The 6’4″ forward, who made his Super League debut in Wakefield’s defeat to Huddersfield Giants in Round 8 of the 2023 season, went on to make 15 appearances for Trinity in the competition. The 20-year-old was crowned Wakefield’s Young Player of the Season at the Club’s end of year awards.",
    "career_highlights": [
      "2022, before joining Featherstone Rovers, where he went on to score three tries in 14 Championship matches.",
      "2022 Championship Young Player of the Year.",
      "2023 season, went on to make 15 appearances for Trinity in the competition.",
      "2023, the Warriors announced the signing of Eseh on a two-year deal as the forward became the seventh signing ahead of the 2024 campaign.",
      "2025 Referee Watch: Round 21 General - 05/08/2025 Kruise Leeming: Reddit AMA General - 05/08/2025 Wolves V Warriors Friday 08 August 2025 K."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/jacob-douglas/",
    "name": "Jacob Douglas",
    "position": "Outside Backs",
    "date_of_birth": "03.03.2004",
    "heritage_number": "1136",
    "debut": "01.06.2024",
    "honours": {
      "Super League": "debut in a Round 13 victory at Warrington Wolves in the 2024 campaign which saw the winger mark his home debut with his first try in the competition.",
      "League Leaders Shield": "1"
    },
    "sponsors": [
      "Charles Brook"
    ],
    "bio": "In 2023, Douglas was promoted to the first team set-up and completed pre-season with the Warriors. He suffered an injury early in the season, but returned to Reserves action against London Broncos, scoring four tries and featured to help Wigan to another Reserves Grand Final victory (2023).",
    "career_highlights": [
      "2004 Heritage Number 1136 Debut 01.",
      "2024 Player Bio A good athlete with speed, power and aerobic endurance; Douglas has shown great individual hard work and a desire to learn and improve which sees him feature in the first team set-up.",
      "2020 was out of action due to the pandemic.",
      "2021, as well as the Reserves and Academy teams in 2022.",
      "2023, Douglas was promoted to the first team set-up and completed pre-season with the Warriors.",
      "2024 campaign which saw the winger mark his home debut with his first try in the competition."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/harvey-makin/",
    "name": "Harvey Makin",
    "position": "Prop Forward",
    "date_of_birth": "17.11.2003",
    "heritage_number": "1139",
    "debut": "11.07.2025",
    "honours": {
      "Challenge Cup": "."
    },
    "sponsors": [
      "Leisuretec UK"
    ],
    "bio": "Makin played five games for Barrow in 2023, as well as an appearance for London Broncos. He also featured twice on dual registration for League One side Oldham, in which he scored a debut try in the Challenge Cup.",
    "career_highlights": [
      "2003 Heritage Number 1139 Debut 11.",
      "2025 Player Bio A skilful prop forward, Harvey Makin adds depth in the forward pack for Matt Peet’s side in 2024.",
      "2020, was one of six Warriors to represent Lancashire in the 2021 Origin Academy clash with Yorkshire.",
      "2023, as well as an appearance for London Broncos.",
      "2024, it was announced that Makin will head out on a season-long loan to Barrow Raiders following pre-season with Wigan."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/tiaki-chan/",
    "name": "Tiaki Chan",
    "position": "Prop Forward",
    "nationality": "New Zealand",
    "date_of_birth": "15.06.2000",
    "heritage_number": "1133",
    "debut": "01.03.2024",
    "career_stats": {
      "appearances": "12"
    },
    "honours": {
      "Super League": "debut for the Dragons against Leeds Rhinos in 2022, his performances earned him a call up for France against England in 2023. Chan scored one try in 12 appearances for Catalans before joining the Warriors ahead of the 2024 campaign.",
      "League Leaders Shield": "1"
    },
    "sponsors": [
      "Evergreen Accountants"
    ],
    "bio": "Having made his Betfred Super League debut for the Dragons against Leeds Rhinos in 2022, his performances earned him a call up for France against England in 2023. Chan scored one try in 12 appearances for Catalans before joining the Warriors ahead of the 2024 campaign.",
    "career_highlights": [
      "2000 Heritage Number 1133 Debut 01.",
      "2024 Player Bio Chan is a dynamic young forward who joins the Warriors for the 2024 season.",
      "2022, his performances earned him a call up for France against England in 2023."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/taylor-kerr/",
    "name": "Taylor Kerr",
    "position": "Forwards",
    "date_of_birth": "01.08.2006",
    "career_stats": {
      "appearances": "13"
    },
    "sponsors": [
      "H2O (NW) Limited"
    ],
    "bio": "Kerr, who scored five tries in 13 appearances for the Academy in 2023, represented Lancashire in their Academy Origin Series win over Yorkshire in which he scored a try in the second clash in Hull.",
    "career_highlights": [
      "2006 Player Bio Kerr started and recorded an assist for St John Fisher in the Year 7 Champion Schools Final at Wembley Stadium.",
      "2023, represented Lancashire in their Academy Origin Series win over Yorkshire in which he scored a try in the second clash in Hull.",
      "2024 season as he scored twice in the Warriors victory over Midlands Hurricanes in pre-season.",
      "2025 Referee Watch: Round 21 General - 05/08/2025 Kruise Leeming: Reddit AMA General - 05/08/2025 Wolves V Warriors Friday 08 August 2025 K."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/nathan-lowe/",
    "name": "Nathan Lowe",
    "position": "Outside Backs",
    "date_of_birth": "16.12.2005",
    "career_stats": {
      "tries": "12",
      "points": "64"
    },
    "sponsors": [
      "The Riversiders Supporters Club"
    ],
    "bio": "An impressive 2023 Academy campaign saw the centre accumulate 64 points [12 tries and eight goals] from 12 starts, which was rewarded with a place on the First Teams pre-season camp to Portugal in 2024.",
    "career_highlights": [
      "2005 Player Bio Lowe made an instant impact in youth rugby as he won a clean sweep of awards at Leigh East, before he later went on to represent Wigan St Judes.",
      "2020, Lowe signed for the Academy in September 2022 where since he has become a vital player.",
      "2023 Academy campaign saw the centre accumulate 64 points [12 tries and eight goals] from 12 starts, which was rewarded with a place on the First Teams pre-season camp to Portugal in 2024.",
      "2023 Academy Origin Series matches against Yorkshire, which included a try in the first clash between the sides.",
      "2025 Referee Watch: Round 21 General - 05/08/2025 Kruise Leeming: Reddit AMA General - 05/08/2025 Wolves V Warriors Friday 08 August 2025 K."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/lukas-mason/",
    "name": "Lukas Mason",
    "position": "Second Row",
    "date_of_birth": "22.12.2005",
    "sponsors": [
      "Bithells Waste Management"
    ],
    "bio": "The second rower has progressed through the junior system at Siddal, Clock Face Miners and Orrell St James."
  },
  {
    "profile_url": "https://wiganwarriors.com/player/noah-hodkinson/",
    "name": "Noah Hodkinson",
    "position": "Full Back",
    "date_of_birth": "29.11.2005",
    "sponsors": [
      "Mount UK Ltd"
    ],
    "bio": "The full-back, who played his amateur rugby at Hindley ARLFC, was included on the First Team’s pre-season camp in Portugal ahead of the 2024 season.",
    "career_highlights": [
      "2005 Player Bio Bolton-born Hodkinson signed his first Warriors contract with the Scholarship programme in 2021.",
      "2025 Referee Watch: Round 21 General - 05/08/2025 Kruise Leeming: Reddit AMA General - 05/08/2025 Wolves V Warriors Friday 08 August 2025 K."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/kian-mcdermott/",
    "name": "Kian McDermott",
    "position": "Prop Forward",
    "date_of_birth": "14.02.2006",
    "sponsors": [
      "MJM Foods (Wigan) Ltd"
    ],
    "bio": "Wigan-born McDermott signed his first contract with the Warriors Scholarship programme in 2021 after progressing through the ranks at Wigan St Patricks.",
    "career_highlights": [
      "2006 Player Bio Wigan-born McDermott signed his first contract with the Warriors Scholarship programme in 2021 after progressing through the ranks at Wigan St Patricks.",
      "2024 campaign which included a try in the Warriors’ Reserves victory over Huddersfield Giants in pre-season.",
      "2025 Referee Watch: Round 21 General - 05/08/2025 Kruise Leeming: Reddit AMA General - 05/08/2025 Wolves V Warriors Friday 08 August 2025 K."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/george-hirst/",
    "name": "George Hirst",
    "position": "Second Row",
    "date_of_birth": "27.05.2001",
    "sponsors": [
      "LCS Civils LTD"
    ],
    "bio": "The Batley-born forward started his rugby league career at local side Dewsbury Moor aged nine before impressive performances at Almondbury Spartans in the Yorkshire Men’s League led to Hirst signing for Oldham in 2023.",
    "career_highlights": [
      "2001 Player Bio George Hirst joined Wigan Warriors from Oldham RLFC in October 2024 on a two-year deal with a further year option.",
      "2024 season under the guidance of head coach Sean Long.",
      "2025 Referee Watch: Round 21 General - 05/08/2025 Kruise Leeming: Reddit AMA General - 05/08/2025 Wolves V Warriors Friday 08 August 2025 K."
    ]
  },
  {
    "profile_url": "https://wiganwarriors.com/player/christian-wade/",
    "name": "Christian Wade",
    "position": "Wing",
    "date_of_birth": "15.05.1991",
    "heritage_number": "1138",
    "debut": "11.07.2025",
    "career_stats": {
      "tries": "93"
    },
    "bio": "On his return to rugby union, Wade played for Racing 92 in France before joining Gloucester for the 2024/2025 season. Wade scored 11 tries during the Premiership season, including two in his final appearance which took his total in the competition to 93 tries – eight behind Chris Ashton’s all-time record.",
    "career_highlights": [
      "2025 Player Bio Wigan Warriors announced the signing of Christian Wade on a short-term deal ahead of the 2025 Good Friday Derby at The Brick Community Stadium.",
      "2013 tour to Australia.",
      "2018, Wade left rugby union to pursue an NFL career for the Buffalo Bills – taking advantage of the NFL’s International Player Pathway Programme.",
      "2025 Referee Watch: Round 21 General - 05/08/2025 Kruise Leeming: Reddit AMA General - 05/08/2025 Wolves V Warriors Friday 08 August 2025 K."
    ]
  }
]